Data/Templates/case/Allrun.bat
@echo off

REM Source runtime environment
set FOAMDIR="%(system/TranslatedFoamPath%)"
set CWD=%CD%
call %FOAMDIR%/setEnvVariables-v%(system/FoamVersion%).bat
cd /d %CWD%

REM Run PowerShell script
type Allrun.ps1 | PowerShell -NoProfile -
